<?php
namespace src\clas;

class GroupA
{
    public function __toString()
    {
        return '<div class="network-parameter">
        <p>Сеть данного класса маркируется нулем в первом бите данного 32-битного числа.</p>
        <p>Остальные 31 бит содержат информацию об адресе самой сети и о конкретном 
           хосте(компьютере)</p>
        <p>Адрес данной сети задается первым байтом, а так, как его первый бит занят 
           нулем всегда, то для определения адреса остается 7 бит или 127 различных 
           адресов.</p>
        <p>Остальные 3 числа или 24 бита задают адрес хоста. Хостов в данной сети может 
           быть 16 777 216</p>
        <h4>Резюме:</h4>
        <p>Число сетей типа A с адресами IPv4 может быть 127</p>
        <p>Число хостов или пользователей в сети типа A с адресами IPv4 может 
           быть 16 777 216</p>
    </div>';
    }
}
